local Error = {}

ERROR_MSG = {
	[10000] = '请求格式不正确',
	[10001] = '手机号或密码不正确',
	[10002] = '请求格式不正确',
	[10003] = 'token不存在',
	[10004] = 'token不存在',
	[10005] = '改手机号未注册',
	[10006] = 'token不存在',
	[10007] = '验证码不正确',
	[10008] = '验证码有效期过了',
	[10009] = '手机号或密码不正确',
	[10010] = 'token不存在',
	[10011] = 'token不存在',
	[10012] = '验证码不正确',
	[10013] = '验证码有效期过了',
	[10014] = 'token不存在',
	[10015] = '发送请求失败',
	[10016] = 'token不存在',
	[10017] = '该手机号不存在',
	[10018] = '手机号已存在',

	--socket
	[100] = '未知消息',
	[101] = '请求字段不合法',
	[102] = 'TOKEN失效',

	[201] = '未知的ROOM_ID',
	[202] = '未知的用户',
	[203] = '此房间类型不接受此消息',
	[204] = '房间已关闭',
	
	[301] = '玩家不在房间内',
	[302] = '玩家不在游戏内',
	[303] = '未轮到此玩家操作',
	[304] = '无效的座位索引',
	[305] = '此座位已有其他玩家',
	[306] = '非管理员不能进行此操作',
	[307] = '带入不满足要求',
	[308] = '玩家未坐下',
	[309] = '此时不应该调用CALL',
	[310] = '此时不应该调用CHECK',
	[311] = '游戏已经开始',
	[312] = '筹码不足',
	[314] = '房间未开始',

	[315] = '房间未暂停',
	[316] = '房间暂停中',
	[317] = '存在未处理申请，不能重复申请',
	[318] = '托管中，禁止喊注',
	[320] = '目标座位没有玩家',
}


function Error.getMsg(errno)
	assert(errno, 'Error.getMsg 出错')
	
	local msg = ERROR_MSG[ errno ]
	if msg == nil then
		msg = '没有定义此出错信息'
	end
	return msg
end

return Error